#include <stdio.h>
#include <math.h>

int main(void)
{
    int n=1,y=1;                                    //Ініціалізуємо зміну для числа з якого починаємо і для факторіалу
    double a=0,sum=0;                               //Ініціалізуємо зміну для значення виразу і суми

    do{                                             //Починаємо цикл
        for(int i = 0;n>i;n--)                      //Цикл для факторіалу
            y=y*n;

        double b = sqrt(n);                         //Підносимо до корення квадратного
        int z = -1*n*b;                             //Степінь e
        a=log10(y)*exp (z);                         //Розвязок для приклада
        sum=sum+a;                                  //Добавляємо до суми зміну а
        if(a<=0.0001)                               //Перевіряємо чи зміна  не є більша від 0.0001
        printf("%lf\n",sum);                        //Якщо число менше то виводимо суму всіх попередніх чисел
        n++;                                        //якщо умова не справдилась , добавляємо до числа n 1 і починаємо спочатку
     }while(a>=0.0001);                             //Умова при якій виконується цикл



}
